Revit 2027 API
BuiltInFailures.StairRampFailures.RailingBadOffset Property
 An arc in the railing sketch has a radius that conflicts with the current rail widths and offsets. Please either increase the radius or modify rail profiles and offsets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RailingBadOffset { get; }
Public Shared ReadOnly Property RailingBadOffset As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RailingBadOffset {
	FailureDefinitionId^ get ();
}
static member RailingBadOffset : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace